fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаполненностьРеквизита</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Если Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание  
		Или Договор.ВКМ_НачалоДействия > ДатаПроведенияРабот 
		Или Договор.ВКМ_КонецДействия < ДатаПроведенияРабот Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Договор не является абоненстким обслуживанием или даты проведения работ не входят в рамки действия договора'");
		Сообщение.Сообщить();
	Иначе 
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период КАК Период,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ЗаполненностьРеквизита КАК ЗаполненностьРеквизита
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|ГДЕ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
		
		Запрос.УстановитьПараметр("Сотрудник", Специалист);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ЗаполненностьРеквизита Тогда
				Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
				Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить(); 
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = ДатаПроведенияРабот;
				Движение.Сотрудник = Специалист;
				Движение.ЧасовКОплате = ВыполненныеРаботы.Итог("ФактическиПотраченоЧасов"); 
				Если ВыборкаДетальныеЗаписи.ПроцентОтРабот <> 0 Тогда
					Движение.СуммаКОплате = Движение.ЧасовКОплате *Договор.ВКМ_СтоимостьЧасаРаботы *ВыборкаДетальныеЗаписи.ПроцентОтРабот/100;
				КонецЕсли;
			Иначе 
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru='Специалисту не установлен процент'");
				Сообщение.Сообщить();
			КонецЕсли;
			
		КонецЦикла;
		// регистр ВКМ_ВыполненныеКлиентуРаботы Приход
			Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
			КоличествоЧасов = ВыполненныеРаботы.Итог("ФактическиПотраченоЧасов");
			Часы = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиента");
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить(); 
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ДатаПроведенияРабот;
			Движение.Клиент = Договор.Организация;
			Движение.Договор = Договор;
			Движение.КоличествоЧасов = КоличествоЧасов;
			Движение.СуммаКОплате = КоличествоЧасов * Договор.ВКМ_СтоимостьЧасаРаботы ;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ,НовыйДокумент)
	
	//При записи документа Обслуживание клиента, 
	//если документ записывается первый раз или если дата, 
	//время или специалист изменились, добавьте в справочник сообщение с текстом, описывающим изменения.
	
	Если НовыйДокумент <> Неопределено Тогда
		Значение = СравнениеДатыИСпециалиста(ЭтотОбъект.Дата,Ссылка.Дата,ЭтотОбъект.Специалист,Ссылка.Специалист);
		Если НовыйДокумент Или Значение <> Неопределено Тогда 
			Если НовыйДокумент Тогда
				Значение = СтрШаблон("%1 %2",ЭтотОбъект.Дата,ЭтотОбъект.Специалист);
			КонецЕсли;
			СпрОбъект = Справочники.ВКМ_УведомленияТелеграммБота.СоздатьЭлемент();
			СпрОбъект.ТекстСообщения = СтрШаблон("По заказу №%1 изменились данные: %2",
			ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ЭтотОбъект.Номер),Значение);  
			СпрОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	НовыйДокумент = ЭтоНовый();
	ПриЗаписи(Отказ,НовыйДокумент);
КонецПроцедуры


#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

Функция СравнениеДатыИСпециалиста(НоваяДата,СтараяДата,НовыйСпециалист,СтарыйСпециалист)
	МассивЗначений = Новый Массив;
	Если СтараяДата <> НоваяДата Тогда
		МассивЗначений.Добавить(НоваяДата);
	КонецЕсли; 
	Если СтарыйСпециалист<> НовыйСпециалист Тогда
		МассивЗначений.Добавить(НовыйСпециалист);	
	КонецЕсли;
	Если МассивЗначений.Количество()>0 Тогда
		Возврат СтрСоединить(МассивЗначений," ");
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти
